snlkuharlocal/src/ChartsOfCharacteristicTypes/СвойстваОбъектов/СвойстваОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СвойстваОбъектов</name>
  <comment>(Общ)</comment>
  <type>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.ТипыКоробов</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.ФР_Коллекции</types>
    <types>CatalogRef.Кассы</types>
    <types>CatalogRef.РайоныДоставки</types>
    <types>CatalogRef.КлассификаторСтранМира</types>
    <types>CatalogRef.Коллекции</types>
    <types>CatalogRef.ФР_ПоловозрастныеПризнаки</types>
    <types>CatalogRef.СтатьиЗатрат</types>
    <types>CatalogRef.ФР_ВидыНоменклатуры</types>
    <types>CatalogRef.ОтсрочкиПлатежа</types>
    <types>EnumRef.ПериодичностьОтчетов</types>
    <types>CatalogRef.ТипыЦен</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>Boolean</types>
    <types>CatalogRef.ТипыСкидок</types>
    <types>CatalogRef.Цвета</types>
    <types>CatalogRef.Размеры</types>
    <types>CatalogRef.Автомобили</types>
    <types>String</types>
    <types>EnumRef.СостояниеДокументов</types>
    <types>CatalogRef.Регионы</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Подразделения</types>
    <types>CatalogRef.ПричиныРекламаций</types>
    <types>Date</types>
    <types>CatalogRef.ФР_Бренды</types>
    <types>Number</types>
    <types>EnumRef.ПланФакт</types>
    <types>EnumRef.СостоянияОтчетов</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ФР_НоменклатурныеГруппы</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.АналитикаОтчетов</types>
    <types>CatalogRef.ИБ</types>
    <types>CatalogRef.ВидыОтчетов</types>
    <numberQualifiers>
      <precision>19</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>250</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВидПланаПродаж</name>
      <description>Вид плана продаж</description>
      <code>00109</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
    <items>
      <name>ВидРаспределения</name>
      <description>Вид распределения</description>
      <code>00111</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
    <items>
      <name>ВидРаспределения2</name>
      <description>Вид распределения 2</description>
      <code>00217</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
    <items>
      <name>ДатаПоследнейСверки</name>
      <description>Дата последней сверки</description>
      <code>00215</code>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </items>
    <items>
      <name>КонтрольЛимитаЗадолженности</name>
      <description>Контроль лимита задолженности</description>
      <code>00216</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>КонтрольПросроченнойЗадолженности</name>
      <description>Контроль просроченной задолженности</description>
      <code>00112</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>Контрагент</name>
      <description>Основной поставщик</description>
      <code>00110</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>СостояниеДокументов</name>
      <description>Состояние документов</description>
      <code>00214</code>
      <type>
        <types>EnumRef.СостояниеДокументов</types>
      </type>
    </items>
    <items>
      <name>ТоварнаяГруппа</name>
      <description>Товарная группа</description>
      <code>00213</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>НазначениеСвойства</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.НазначенияСвойствКатегорийОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ЧЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

snlkuharlocal/src/ChartsOfCharacteristicTypes/СвойстваОбъектов/ManagerModule.bsl
// Чирков 13.02.2024 +++
Функция НайтиПоИмени(Имя, НазначениеСвойства) Экспорт
	Результат = ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка();
	
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка	
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов	
	|ГДЕ
	|	НазначениеСвойства = &НазначениеСвойства
	|	И Имя = &Имя
	|";
	
	
	Запрос.УстановитьПараметр("Имя", 				Имя);
	Запрос.УстановитьПараметр("НазначениеСвойства", НазначениеСвойства);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Результат = Выборка.Ссылка;	
	КонецЕсли;	 
	
	Возврат Результат;	
КонецФункции // ()
// Чирков 13.02.2024 +++
